Enums/ВариантыСайтаЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВариантыСайтаЖКХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СайтЖКХХВОЯ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СайтНаПлатформеБитрикс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Услуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Услуги</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПотребителяУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеНормПотребления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОснованияНормПотребления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияРасчетнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПотребителейУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеПрибораУчетаДляЛьготы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬУсловиеРасчетаЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬДополнительнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйМетод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПорогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМашиноМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМашиноМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеРеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчетаПоСредней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаПоСредней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаПоСредней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецСезона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВидамТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчитыватьЭнергоемкость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУХолоднаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУГарячаяВода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвоКубов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУслугиПФУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыТарифов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/НастройкаПараметровУчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокИзменен = Ложь;
	ПолнотекстовыйПоискИзменен = Ложь;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Элементы.ПараметрыАдминистрированияИБ.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГраничнаяДатаСтимулирующегоТарифа.Видимость = НаборКонстант.ИспользоватьСтимулирующийТариф;
	
	Элементы.ВариантыСайтаЖКХ.Видимость = НаборКонстант.ИспользоватьВыгрузкуНаСайт;
	Элементы.Декорация7.Видимость = НЕ НаборКонстант.ИспользоватьВыгрузкуНаСайт;
	
	Если НаборКонстант.ВариантСайтаХВОЯ Тогда
		ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтЖКХХВОЯ;
	ИначеЕсли НаборКонстант.ВариантСайтаБитрикс Тогда
		ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтНаПлатформеБитрикс;
	Иначе
		ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.ПустаяСсылка();
	КонецЕсли;

	Элементы.ИспользоватьПодомовойУчетЗатрат.Видимость = НаборКонстант.ИспользоватьОбменДанными;	
	
	ПолучитьПорядокОплат();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
	
	Если ЗаголовокИзменен Тогда
		СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения();
		ЗаголовокИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПолнотекстовыйПоискИзменен Тогда
		ПолнотекстовыйПоискИзменен = Ложь;
		Разрешен = Константы.ИспользоватьПолнотекстовыйПоиск.Получить();
		
		Если Разрешен Тогда
			ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Разрешить);
		Иначе
			ПолнотекстовыйПоиск.УстановитьРежимПолнотекстовогоПоиска(РежимПолнотекстовогоПоиска.Запретить);
		КонецЕсли;
			
	КонецЕсли;	
	
	Дерево = РеквизитФормыВЗначение("ПорядокОплат"); 
	
	НомерСортировкиВидУслуги = 0;
	Для каждого СтрокаУровень1 Из Дерево.Строки Цикл
		
		НомерСортировкиВидУслуги = НомерСортировкиВидУслуги +1;
		Если ЗначениеЗаполнено(СтрокаУровень1.Услуга) Тогда
		
			ОбъектВидУслуги = СтрокаУровень1.Услуга.ПолучитьОбъект();
			ОбъектВидУслуги.ПолеСортировки = НомерСортировкиВидУслуги;
			Попытка
				ОбъектВидУслуги.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли; 		
		
		НомерСортировкиУслуги = 0;
		Для каждого СтрокаУровень2 Из СтрокаУровень1.Строки Цикл
			
			НомерСортировкиУслуги = НомерСортировкиУслуги +1;
			ОбъектУслуга = СтрокаУровень2.Услуга.ПолучитьОбъект();
			ОбъектУслуга.ПолеСортировки = НомерСортировкиУслуги;
			Попытка
				ОбъектУслуга.Записать();
			Исключение
			КонецПопытки;

		КонецЦикла;
	КонецЦикла;
	
	Пользователи.УстановитьДоступностьКИБДляПользователяМП();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокСистемыПриИзменении(Элемент)
	
	ЗаголовокИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыАдминистрированияИБ(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыАдминистрированияСервернойИБ");
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПорядокОплат()
	
    Дерево = РеквизитФормыВЗначение("ПорядокОплат");
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Услуги.Ссылка КАК Услуга,
		|	ВидыУслуг.Ссылка КАК ВидУслуги
		|ИЗ
		|	Справочник.Услуги КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыУслуг КАК ВидыУслуг
		|		ПО Услуги.ВидУслуги = ВидыУслуг.Ссылка
		|ГДЕ
		|	НЕ Услуги.ЭтоГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	Услуги.Ссылка,
		|	ВидыУслуг.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыУслуг.ПолеСортировки,
		|	Услуги.ПолеСортировки
		|ИТОГИ ПО
		|	ВидУслуги,
		|	Услуга";
	
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		СтрокаУровень1 = Дерево.Строки.Добавить();
		СтрокаУровень1.Услуга = Выборка.ВидУслуги;
		
		ВыборкаУслуга = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаУслуга.Следующий() Цикл
			
			СтрокаУровень2= СтрокаУровень1.Строки.Добавить();
			СтрокаУровень2.Услуга = ВыборкаУслуга.Услуга;
			
		КонецЦикла;
	КонецЦикла;
	
	ЭтаФорма.ЗначениеВРеквизитФормы(Дерево, "ПорядокОплат");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтимулирующийТарифПриИзменении(Элемент)
	
	Элементы.ГраничнаяДатаСтимулирующегоТарифа.Видимость = НаборКонстант.ИспользоватьСтимулирующийТариф;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаЗакон(Команда)
	ЗапуститьПриложение("http://zakon2.rada.gov.ua/laws/show/2297-17");
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВариантКоттеджныйПоселокПриИзменении(Элемент)
	
	НаборКонстант.ИспользоватьВариантГород = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВариантГородПриИзменении(Элемент)
	
	 НаборКонстант.ИспользоватьВариантКоттеджныйПоселок = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМобильноеПриложениеПриИзменении(Элемент)
	
	 Элементы.ВерсияМобильногоПриложения.Доступность = НаборКонстант.ИспользоватьМобильноеПриложение;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВыгрузкуНаСайтПриИзменении(Элемент)
	Элементы.ВариантыСайтаЖКХ.Видимость = НаборКонстант.ИспользоватьВыгрузкуНаСайт;
	Элементы.Декорация7.Видимость = НЕ НаборКонстант.ИспользоватьВыгрузкуНаСайт;
КонецПроцедуры

&НаКлиенте
Процедура ВариантыСайтаЖКХПриИзменении(Элемент)
	
	ВариантыСайтаЖКХПриИзмененииНаСерврере();
		
КонецПроцедуры

&НаСервере
Процедура ВариантыСайтаЖКХПриИзмененииНаСерврере()

	Если ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтЖКХХВОЯ Тогда
		НаборКонстант.ВариантСайтаХВОЯ = Истина;
		НаборКонстант.ВариантСайтаБитрикс = Ложь;
	ИначеЕсли ВариантыСайтаЖКХ = Перечисления.ВариантыСайтаЖКХ.СайтНаПлатформеБитрикс Тогда
		НаборКонстант.ВариантСайтаХВОЯ = Ложь;
		НаборКонстант.ВариантСайтаБитрикс = Истина;
	КонецЕсли;

КонецПроцедуры // ()


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ НаборКонстант.ИспользоватьВыгрузкуНаСайт Тогда
		НаборКонстант.ВариантСайтаХВОЯ = Ложь;
		НаборКонстант.ВариантСайтаБитрикс = Ложь;
	КонецЕсли;	
	
	Если НЕ НаборКонстант.ИспользоватьОбменДанными Тогда
		НаборКонстант.ИспользоватьПодомовойУчетЗатрат = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбменДаннымиПриИзменении(Элемент)
	
	Элементы.ИспользоватьПодомовойУчетЗатрат.Видимость = НаборКонстант.ИспользоватьОбменДанными;	
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаВидеоУрок(Команда)
	
	НавигационнаяСсылка = "https://www.youtube.com/watch?v=GToc2arX-rc";
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);

КонецПроцедуры
